zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
/***************************************************************************//**
* \file cy_flash_v2.c
* \version 3.150.1
*
* \brief
* Provides the public functions for the API for the Flash Driver.
*
********************************************************************************
* \copyright
* (c) 2021-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"
#if defined(CY_IP_MXFLASHC_VERSION_ECT)

#include "cy_flash.h"
#include "cy_sysint.h"
#include "cy_ipc_drv.h"
#include "cy_syslib.h"
#include "cy_syspm.h"

/** SROM API flash region ID shift for flash row information */
#define CY_FLASH_REGION_ID_SHIFT           (16U)
#define CY_FLASH_ROW_ID_MASK               (0xFFFFU)
/** SROM API flash region IDs */
#define CY_FLASH_REGION_ID_MAIN         (0UL)
#define CY_FLASH_REGION_ID_WFLASH       (1UL)

#define ADDRESS_LENGTH_32_BIT (4U)
#define ADDRESS_LENGTH_256_BIT (32U)
#define DATA_LENGTH_32_BIT (1U)
#define DATA_LENGTH_256_BIT (8U)
#define CY_FLASH_CODE_ECC_INJECT_POS          (0x03UL)       /** CODE ECC injection position shift */
#define CY_FLASH_WORK_ECC_INJECT_POS          (0x02UL)       /** WORK ECC injection position shift */
#define CY_FLASH_CACHE_ECC_INJECT_POS         (0x02UL)       /** CACHE ECC injection position shift */

static cy_en_flashdrv_status_t Cy_Flash_GetRowDetails(FLASHC_Type *base, uint32_t rowAddr, uint8_t *rowID, cy_en_flash_checksum_bank_t *bank, cy_en_flash_checksum_region_t *region);
static cy_en_flashdrv_status_t Cy_Flash_CalculateHash_Ext(const cy_stc_flash_computehash_config_t *config,  uint32_t* hashPtr);
static cy_en_flashdrv_status_t Cy_Flash_EraseSector_Ext(FLASHC_Type *base, const cy_stc_flash_erasesector_config_t *config, cy_en_flash_driver_blocking_t block);
static en_flash_bounds_t Cy_Flash_WorkBoundsCheck(FLASHC_Type *base, uint32_t address);
static en_flash_bounds_t Cy_Flash_MainBoundsCheck(FLASHC_Type *base, uint32_t address);
static en_flash_bounds_t Cy_Flash_BoundsCheck(FLASHC_Type *base, uint32_t flashAddr);
static cy_en_flashdrv_status_t Cy_Flash_ProcessOpcode(uint32_t opcode);
static cy_en_syspm_status_t Cy_Flash_DSCallbackFunc(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);
static uint8_t g_non_block_context = 0;
#if defined(FLASHC1)
static uint8_t g_non_block_context1 = 0;
#endif
static cy_stc_syspm_callback_params_t g_ds_params;
static cy_stc_syspm_callback_t g_ds_cbHandler;

static inline bool Cy_Flash_IsValidBase(FLASHC_Type *base)
{
    bool isValid = (base == (FLASHC_Type *)FLASHC);
#if defined(FLASHC1)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address comparison.');
    isValid = isValid || (base == (FLASHC_Type *)FLASHC1);
#endif
    return isValid;
}

static inline uint8_t* Cy_Flash_GetNonBlockContext(FLASHC_Type *base)
{
    if (base == (FLASHC_Type *)FLASHC)
    {
        return &g_non_block_context;
    }
#if defined(FLASHC1)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address comparison.');
    if (base == (FLASHC_Type *)FLASHC1)
    {
        return &g_non_block_context1;
    }
#endif

    return NULL;
}

/*******************************************************************************
* Function Name: Cy_Flash_CallSromApiForFlashWrite
****************************************************************************//**
*
* This function call SROM API driver for flash writing (e.g. program row,
* erase sector). Then, processes response message of the 
* driver API and response message of SROM API if required.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param apiArgs pointer to SROM API arguments.
*
* \param block driver blocking mode \ref cy_en_flash_driver_blocking_t
*
* \return Returns the status of the Flash operation.
*
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_CallSromApiForFlashWrite(FLASHC_Type *base, const un_srom_api_args_t* apiArgs, cy_en_flash_driver_blocking_t block)
{
    if (!Cy_Flash_IsValidBase(base))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    if(block == CY_FLASH_DRIVER_BLOCKING)
    {
        un_srom_api_resps_t apiResp = {{ 0UL }};

        /* Call SROM API with blocking mode */
        cy_en_srom_driver_status_t sromDrvStatus;
        sromDrvStatus = Cy_Srom_CallApi(apiArgs, &apiResp);
        if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
        {
            return CY_FLASH_DRV_IPC_BUSY;
        }
        else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
        {
            return CY_FLASH_DRV_SROM_API_TIMEOUT;
        }
        else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
        {
            return CY_FLASH_DRV_ERR_UNC;
        }
        else
        {
            cy_en_flashdrv_status_t result;
            result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
            if(result != CY_FLASH_DRV_SUCCESS)
            {
                return result;
            }

            /* Invalidates the flash cache and buffer */
            base->FLASH_CMD = _VAL2FLD(FLASHC_FLASH_CMD_INV, 1U);

            // Wait for completion (HW will clear bit)
            while (_FLD2VAL(FLASHC_FLASH_CMD_INV, base->FLASH_CMD) != 0U)
            {
            }

            return CY_FLASH_DRV_SUCCESS;
        }
    }
    else
    {
        /* Call SROM API with non-blocking mode */
        cy_en_srom_driver_status_t status = Cy_Srom_CallApi_NonBlock(apiArgs);

        if(status == CY_SROM_DR_API_ERROR)
        {
            /* SROM rejected the operation (e.g. invalid flash address).
             * Retrieve the specific error from the SROM response. */
            un_srom_api_resps_t apiResp = {{ 0UL }};
            (void)Cy_Srom_GetApiResponse(&apiResp);
            return Cy_Flash_ProcessOpcode(apiResp.resp[0]);
        }

