zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
        if ( status != CY_SROM_DR_SUCCEEDED)
        {
            /* The IPC structure is already locked by another process */
            return CY_FLASH_DRV_IPC_BUSY;
        }
        return CY_FLASH_DRV_SUCCESS;
    }
}


/*******************************************************************************
* Function Name: Cy_Flash_Program_WorkFlash
****************************************************************************//**
*
* This function writes an array of data to work flash. Reports success or
* or a reason for failure.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Write is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_programrow_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
* \note row or page is same and of the size 512 bytes
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Program_WorkFlash(const cy_stc_flash_programrow_config_t* config)
{
    cy_en_flashdrv_status_t status = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    FLASHC_Type *base;

    /* Checks if input pointers are not NULL */
    if(config == NULL)
    {
        return status;
    }

    /* Resolve base from destination address */
    if (Cy_Flash_ResolveBase((uint32_t)config->destAddr, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return status;
    }

    /* Checks if input address are valid */
    if((Cy_Flash_WorkBoundsCheck(base, (uint32_t)config->destAddr) == CY_FLASH_OUT_OF_BOUNDS) || (config->dataAddr == NULL))
    {
        return status;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.ProgramRow.arg0.opcode         = (uint32_t)CY_SROM_OP_FLASH_PROGRAM_WFLASH;
    apiArgs.ProgramRow.arg0.blocking       = (uint32_t)CY_FLASH_PROGRAMROW_BLOCKING;
    apiArgs.ProgramRow.arg0.skipBlankCheck = (uint32_t)config->skipBC;
    apiArgs.ProgramRow.arg1.dataLoc        = (uint32_t)config->dataLoc;
    apiArgs.ProgramRow.arg1.dataSize       = (uint32_t)config->dataSize;
    apiArgs.ProgramRow.arg1.interruptMask  = (uint32_t)config->intrMask;
    apiArgs.ProgramRow.arg2.dstAddr        = (uint32_t)config->destAddr;
    apiArgs.ProgramRow.arg3.srcAddr        = (uint32_t)config->dataAddr;
    /* Call SROM API driver and process response */
    status = Cy_Flash_CallSromApiForFlashWrite(base, &apiArgs, CY_FLASH_DRIVER_BLOCKING);
    return status;
}

/*******************************************************************************
* Function Name: Cy_Flash_Program
****************************************************************************//**
*
* This function writes an array of data to a single row of flash. Reports success or
* or a reason for failure.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Write is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_programrow_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \param block specifies if the function to execute in blocking or non blocking mode.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
* \note row or page is same and of the size 512 bytes
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Program(const cy_stc_flash_programrow_config_t* config, cy_en_flash_driver_blocking_t block)
{
    cy_en_flashdrv_status_t status;
    FLASHC_Type *base;

    if (config == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Resolve base from destination address */
    if (Cy_Flash_ResolveBase((uint32_t)config->destAddr, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    uint8_t *nonBlockContext = Cy_Flash_GetNonBlockContext(base);

    if (nonBlockContext == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks if input pointers are not NULL */
    if((Cy_Flash_BoundsCheck(base, (uint32_t)config->destAddr) == CY_FLASH_OUT_OF_BOUNDS) || (config->dataAddr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.ProgramRow.arg0.opcode         = (uint32_t)CY_SROM_OP_FLASH_PROGRAM_ROW;
    apiArgs.ProgramRow.arg0.blocking       = (uint32_t)config->blocking;
    apiArgs.ProgramRow.arg0.skipBlankCheck = (uint32_t)config->skipBC;
    apiArgs.ProgramRow.arg1.dataLoc        = (uint32_t)config->dataLoc;
    apiArgs.ProgramRow.arg1.dataSize       = (uint32_t)config->dataSize;
    apiArgs.ProgramRow.arg1.interruptMask  = (uint32_t)config->intrMask;
    apiArgs.ProgramRow.arg2.dstAddr        = (uint32_t)config->destAddr;
    apiArgs.ProgramRow.arg3.srcAddr        = (uint32_t)config->dataAddr;
    /* Call SROM API driver and process response */
    status = Cy_Flash_CallSromApiForFlashWrite(base, &apiArgs, block);

