zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
    if(status == CY_FLASH_DRV_SUCCESS && block == CY_FLASH_DRIVER_NON_BLOCKING)
    {
        *nonBlockContext = (uint8_t)(FLASHC_FM_CTL_ECT_STATUS_PGM_WORK_Msk | FLASHC_FM_CTL_ECT_STATUS_PGM_CODE_Msk);
        status = CY_FLASH_DRV_OPERATION_STARTED;
    }
    return status;
}

/*******************************************************************************
* Function Name: Cy_Flash_Checksum
****************************************************************************//**
*
* Returns a checksum value of the specified flash row. supports only blocking
* mode for now.
*
* \param config configuration of this function.
* This parameter is defined by the \ref cy_stc_flash_checksum_config_t.
*
* \param checksumPtr The pointer to the address where checksum is to be stored
*
* \return Returns the status of the Flash operation.
*
* \note row or page is same and of the size 512 bytes
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Checksum(const cy_stc_flash_checksum_config_t *config, uint32_t* checksumPtr)
{
    if ((config == NULL) || (checksumPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks whether the input parameters are valid */
    if (config->rowId >= CY_FLASH_NUMBER_ROWS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 14.3', 1, \
'Checked manually. Intentional  expression will always be true for CAT1C devices.')
    if(CPUSS_FLASH_SIZE >= 4096u)
    {
        apiArgs.CheckSum.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_CHECKSUM;
        apiArgs.CheckSum.arg0.region = (uint32_t)config->region;
        apiArgs.CheckSum.arg0.whole  = (uint32_t)config->whole;
        apiArgs.CheckSum.arg0.row_id = (uint32_t)config->rowId;
        apiArgs.CheckSum.arg0.bank   = (uint32_t)config->bank;
    }
    else
    {
        apiArgs.CheckSumLessThan4M.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_CHECKSUM;
        apiArgs.CheckSumLessThan4M.arg0.region = (uint32_t)config->region;
        apiArgs.CheckSumLessThan4M.arg0.whole  = (uint32_t)config->whole;
        apiArgs.CheckSumLessThan4M.arg0.row_id = (uint32_t)config->rowId;
        apiArgs.CheckSumLessThan4M.arg0.bank   = (uint32_t)config->bank;
    }
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3')
    /* Call SROM API with blocking mode */
    un_srom_api_resps_t apiResp = {{ 0UL }};
    cy_en_srom_driver_status_t sromDrvStatus;
    sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
    if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
    {
        return CY_FLASH_DRV_IPC_BUSY;
    }
    else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
    {
        return CY_FLASH_DRV_SROM_API_TIMEOUT;
    }
    else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    else
    {
        /* non-empty terminating "else" statement. */
    }

    /* Process response message from API */
    cy_en_flashdrv_status_t result;
    result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
    if(result == CY_FLASH_DRV_SUCCESS)
    {
        // checksum is in data1 not data0. the the pointer returned is to data0.
        uint32_t data[2];
//        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1','Checked manually. Intentional Non boolean type is interpreted as boolean.');
        Cy_IPC_Drv_ReadDDataValue(Cy_IPC_Drv_GetIpcBaseAddress((uint32_t)CY_IPC_CHAN_SYSCALL), data );
        *checksumPtr = data[1];
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_Flash_CalculateHash_Ext
****************************************************************************//**
*
* Returns a hash value of the specified region of flash. supports only blocking
* mode for now.
*
* \param config configuration of this function.
* This parameter is defined by the \ref cy_stc_flash_computehash_config_t.
*
* \param hashPtr The pointer to the address where hash is to be stored
*
* \return Returns the status of the Flash operation.
*
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_CalculateHash_Ext(const cy_stc_flash_computehash_config_t *config,  uint32_t* hashPtr)
{
    /* Checks whether the input parameters are valid */
    if ((config->startAddr == NULL) || (config->numOfByte == 0UL) || (hashPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.ComputeHash.arg0.opcode      = (uint32_t)CY_SROM_OP_FLASH_HASH;
    apiArgs.ComputeHash.arg0.type        = (uint32_t)config->type;
    apiArgs.ComputeHash.arg1.start_addr  = (uint32_t)config->startAddr;
    apiArgs.ComputeHash.arg2.number_byte = (config->numOfByte - 1UL);

    /* Call SROM API with blocking mode */
    un_srom_api_resps_t apiResp = {{ 0UL }};
    cy_en_srom_driver_status_t sromDrvStatus;
    sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
    if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
    {
        return CY_FLASH_DRV_IPC_BUSY;
    }
    else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
    {
        return CY_FLASH_DRV_SROM_API_TIMEOUT;
    }
    else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    else
    {
        /* non-empty terminating "else" statement. */
    }

    /* Process response message from API */
    cy_en_flashdrv_status_t result;
    result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
    if(result == CY_FLASH_DRV_SUCCESS)
    {
        *hashPtr = apiResp.ComputeHash.resp0.hash_crc;
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_Flash_WorkBoundsCheck
****************************************************************************//**
*
* Checks if Flash address is out of work region.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param address Address to be checked
*
* \return en_flash_bounds_t
*
*******************************************************************************/
static en_flash_bounds_t Cy_Flash_WorkBoundsCheck(FLASHC_Type *base, uint32_t address)
{
    cy_en_bankmode_t bankmode = Cy_Flashc_GetWorkBankMode_Base(base);

#if defined(FLASHC1)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address comparison.');
    bool isFlashc1 = (base == (FLASHC_Type *)FLASHC1);
#endif

    if(bankmode == CY_FLASH_SINGLE_BANK_MODE)
    {
#if defined(FLASHC1)
        if (!isFlashc1)
#endif
        {
            if(( CY_WFLASH_LG_SBM_TOP <= address) && (address < CY_WFLASH_LG_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

