zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
            if((CY_WFLASH_SM_SBM_TOP <= address) && (address < CY_WFLASH_SM_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#if defined(FLASHC1)
        else
        {
            if(( CY_WFLASH1_LG_SBM_TOP <= address) && (address < CY_WFLASH1_LG_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if((CY_WFLASH1_SM_SBM_TOP <= address) && (address < CY_WFLASH1_SM_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#endif
    }
    else
    {
#if defined(FLASHC1)
        if (!isFlashc1)
#endif
        {
            if(( CY_WFLASH_LG_DBM0_TOP <= address) && (address < CY_WFLASH_LG_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_WFLASH_SM_DBM0_TOP <= address) && (address < CY_WFLASH_SM_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_WFLASH_LG_DBM1_TOP <= address) && (address < CY_WFLASH_LG_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_WFLASH_SM_DBM1_TOP <= address) && (address < CY_WFLASH_SM_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#if defined(FLASHC1)
        else
        {
            if(( CY_WFLASH1_LG_DBM0_TOP <= address) && (address < CY_WFLASH1_LG_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_WFLASH1_SM_DBM0_TOP <= address) && (address < CY_WFLASH1_SM_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_WFLASH1_LG_DBM1_TOP <= address) && (address < CY_WFLASH1_LG_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_WFLASH1_SM_DBM1_TOP <= address) && (address < CY_WFLASH1_SM_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#endif
    }

    return(CY_FLASH_OUT_OF_BOUNDS);
}

/*******************************************************************************
* Function Name: Cy_Flash_MainBoundsCheck
****************************************************************************//**
*
* Returns 1 if Flash address is out of main region, otherwise returns 0.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param address Address to be checked
*
* \return 1 - out of bound, 0 - in flash bounds
*
*******************************************************************************/
static en_flash_bounds_t Cy_Flash_MainBoundsCheck(FLASHC_Type *base, uint32_t address)
{
    cy_en_bankmode_t bankmode = Cy_Flashc_GetMainBankMode_Base(base);

#if defined(FLASHC1)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address comparison.');
    bool isFlashc1 = (base == (FLASHC_Type *)FLASHC1);
#endif

    if(bankmode == CY_FLASH_SINGLE_BANK_MODE)
    {
#if defined(FLASHC1)
        if (!isFlashc1)
#endif
        {
            if(( CY_FLASH_LG_SBM_TOP <= address) && (address < CY_FLASH_LG_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH_SM_SBM_TOP <= address) && (address < CY_FLASH_SM_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#if defined(FLASHC1)
        else
        {
            if(( CY_FLASH1_LG_SBM_TOP <= address) && (address < CY_FLASH1_LG_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH1_SM_SBM_TOP <= address) && (address < CY_FLASH1_SM_SBM_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#endif
    }
    else
    {
#if defined(FLASHC1)
        if (!isFlashc1)
#endif
        {
            if(( CY_FLASH_LG_DBM0_TOP <= address) && (address < CY_FLASH_LG_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH_SM_DBM0_TOP <= address) && (address < CY_FLASH_SM_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH_LG_DBM1_TOP <= address) && (address < CY_FLASH_LG_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH_SM_DBM1_TOP <= address) && (address < CY_FLASH_SM_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#if defined(FLASHC1)
        else
        {
            if(( CY_FLASH1_LG_DBM0_TOP <= address) && (address < CY_FLASH1_LG_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH1_SM_DBM0_TOP <= address) && (address < CY_FLASH1_SM_DBM0_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH1_LG_DBM1_TOP <= address) && (address < CY_FLASH1_LG_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }

            if(( CY_FLASH1_SM_DBM1_TOP <= address) && (address < CY_FLASH1_SM_DBM1_END))
            {
                return(CY_FLASH_IN_BOUNDS);
            }
        }
#endif
    }

    return(CY_FLASH_OUT_OF_BOUNDS);
}

/*******************************************************************************
* Function Name: Cy_Flash_BoundsCheck
****************************************************************************//**
*
* Returns 1 if Flash address is out of boundary, otherwise returns 0.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param flashAddr Address to be checked
*
* \return 1 - out of bound, 0 - in flash bounds
*
*******************************************************************************/
static en_flash_bounds_t Cy_Flash_BoundsCheck(FLASHC_Type *base, uint32_t flashAddr)
{
    if(Cy_Flash_WorkBoundsCheck(base, flashAddr) == CY_FLASH_IN_BOUNDS)
    {
        return(CY_FLASH_IN_BOUNDS);
    }

    if(Cy_Flash_MainBoundsCheck(base, flashAddr) == CY_FLASH_IN_BOUNDS)
    {
        return(CY_FLASH_IN_BOUNDS);
    }

    return (CY_FLASH_OUT_OF_BOUNDS);
}

