zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_ResolveBase
****************************************************************************//**
*
* Determines which flash controller (FLASHC or FLASHC1) owns the given address
* by checking all work-flash and main-flash address ranges.
*
* \param addr The flash address to resolve.
*
* \param base Output pointer. On success, set to the FLASHC_Type pointer of the
*        flash controller that owns the given address.
*
* \return \ref CY_FLASH_DRV_SUCCESS if the address is in bounds and *base is set.
*         \ref CY_FLASH_DRV_INVALID_INPUT_PARAMETERS if the address is out of all
*         flash ranges.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_ResolveBase(uint32_t addr, FLASHC_Type **base)
{
    if (base == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Check FLASHC ranges */
    if (Cy_Flash_BoundsCheck((FLASHC_Type *)FLASHC, addr) == CY_FLASH_IN_BOUNDS)
    {
        *base = (FLASHC_Type *)FLASHC;
        return CY_FLASH_DRV_SUCCESS;
    }

#if defined(FLASHC1)
    /* Check FLASHC1 ranges */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address comparison.');
    if (Cy_Flash_BoundsCheck((FLASHC_Type *)FLASHC1, addr) == CY_FLASH_IN_BOUNDS)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address assignment.');
        *base = (FLASHC_Type *)FLASHC1;
        return CY_FLASH_DRV_SUCCESS;
    }
#endif /* defined(FLASHC1) */

    return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
}

/*******************************************************************************
* Function Name: Cy_Flash_ProcessOpcode
****************************************************************************//**
*
* Converts System Call returns to the Flash driver return defines.
*
* \param opcode The value returned by the System Call.
*
* \return Flash driver return. \ref cy_en_flashdrv_status_t only support a 
*         part of SROM response. please use Cy_Srom_GetApiResponse to
*         get complete status of SROM API.
*
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_ProcessOpcode(uint32_t opcode)
{
    cy_en_flashdrv_status_t retVal;
    cy_en_srom_api_status_t apiStatus;
    apiStatus = Cy_Srom_ConvertRespToStatus(opcode);

    // Process error code
    switch (apiStatus)
    {
    case CY_SROM_STATUS_SUCCESS:
        retVal = CY_FLASH_DRV_SUCCESS;
        break;
    case CY_SROM_STATUS_INVALID:
        retVal = CY_FLASH_DRV_ERR_UNC;
        break;
    case CY_SROM_STATUS_INVALID_PROTECTION:
        retVal = CY_FLASH_DRV_INV_PROT;
        break;
    case CY_SROM_STATUS_INVALID_FM_PL:
        retVal = CY_FLASH_DRV_INVALID_FM_PL;
        break;
    case CY_SROM_STATUS_INVALID_FLASH_ADDR:
        retVal = CY_FLASH_DRV_INVALID_FLASH_ADDR;
        break;
    case CY_SROM_STATUS_NVM_PROTECTED:
        retVal = CY_FLASH_DRV_ROW_PROTECTED;
        break;
    case CY_SROM_STATUS_INVALID_IPC_STRUCT:
        retVal = CY_FLASH_DRV_IPC_BUSY;
        break;
    case CY_SROM_STAUTS_CHECKSUM_NON_ZERO:
        retVal = CY_FLASH_DRV_CHECKSUM_NON_ZERO;
        break;
    case CY_SROM_STATUS_SECTOR_SUSPEND:
        retVal = CY_FLASH_DRV_SECTOR_SUSPEND;
        break;
    case CY_SROM_STATUS_NO_ERASE_SUSPEND:
        retVal = CY_FLASH_DRV_NO_ERASE_SUSPEND;
        break;
    case CY_SROM_STATUS_FLASH_NOT_ERASED:
        retVal = CY_FLASH_DRV_FLASH_NOT_ERASED;
        break;
    case CY_SROM_STATUS_NO_ERASE_ONGOING:
        retVal = CY_FLASH_DRV_NO_ERASE_ONGOING;
        break;
    case CY_SROM_STATUS_ACTIVE_ERASE:
        retVal = CY_FLASH_DRV_ACTIVE_ERASE;
        break;
    case CY_SROM_STAUTS_INVALID_DATA_WIDTH:
        retVal = CY_FLASH_DRV_INVALID_DATA_WIDTH;
        break;
    case CY_SROM_STATUS_FLASH_SAFTEY_ENABLED:
        retVal = CY_FLASH_DRV_FLASH_SAFTEY_ENABLED;
        break;
    case CY_SROM_STATUS_INVALID_SFLASH_ADDR:
        retVal = CY_FLASH_DRV_INVALID_SFLASH_ADDR;
        break;
    case CY_SROM_STATUS_SFLASH_BACKUP_ERASED:
        retVal = CY_FLASH_DRV_SFLASH_BACKUP_ERASED;
        break;
    default:
        retVal = CY_FLASH_DRV_ERR_UNC;
        break;
    }

    return (retVal);
}

/*******************************************************************************
* Function Name: Cy_Flash_EraseSector_Ext
****************************************************************************//**
*
* This function Starts the sector erase operation on the specified sector. 
* This function cannot be called on SFLASH. Reports success 
* or a reason for failure.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Erase is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param config configuration of this function.
* This parameter is defined by the \ref cy_stc_flash_erasesector_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \param block specifies if the function to execute in blocking or non blocking mode.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_EraseSector_Ext(FLASHC_Type *base, const cy_stc_flash_erasesector_config_t *config, cy_en_flash_driver_blocking_t block)
{
    cy_en_flashdrv_status_t status;
    if (!Cy_Flash_IsValidBase(base))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks if input pointers are not NULL */
    if (config == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

