zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
    /* Checks if input address is in work/main region */
    if(Cy_Flash_BoundsCheck(base, (uint32_t)(config->sectorAddr)) == CY_FLASH_OUT_OF_BOUNDS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks if input address is word aligned */
    if(((uint32_t)(config->sectorAddr) % sizeof(uint32_t)) != 0UL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.EraseSector.arg0.opcode        = (uint32_t)CY_SROM_OP_FLASH_ERASE_SECTOR;
    apiArgs.EraseSector.arg0.blocking      = (uint32_t)config->blocking;
    apiArgs.EraseSector.arg0.interruptMask = (uint32_t)config->intrMask;
    apiArgs.EraseSector.arg1.address       = (uint32_t)config->sectorAddr;

    /* Call SROM API driver and process response */
    status = Cy_Flash_CallSromApiForFlashWrite(base, &apiArgs, block);
    return status;
}

/*******************************************************************************
* Function Name: Cy_Flash_EraseSuspend
****************************************************************************//**
*
* This function suspends an ongoing erase operation. User should not read from a 
* sector which is suspended from an erase operation. Cy_Flash_ProgramRow function 
* will return error if invoked on suspended sector.
* This function cannot be called on SFLASH. Reports success 
* or a reason for failure. Does not return until the Erase operation is complete.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
* This function supports only blocking mode for now.
*
* \param base Pointer to the selected FLASH controller instance.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseSuspend_Base(FLASHC_Type *base)
{
    if (!Cy_Flash_IsValidBase(base))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.EraseSuspend.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_ERASE_SUSPEND;

    /* Call SROM API with blocking mode */
    un_srom_api_resps_t apiResp = {{ 0UL }};
    cy_en_srom_driver_status_t sromDrvStatus;
    sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
    if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
    {
        return CY_FLASH_DRV_IPC_BUSY;
    }
    else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
    {
        return CY_FLASH_DRV_SROM_API_TIMEOUT;
    }
    else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    else
    {
        /* non-empty terminating "else" statement. */
    }

    /* Process response message from API */
    cy_en_flashdrv_status_t result;
    result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
    if(result == CY_FLASH_DRV_SUCCESS)
    {
        /* Invalidates the flash cache and buffer */
        base->FLASH_CMD = _VAL2FLD(FLASHC_FLASH_CMD_INV, 1U);

        // Wait for completion (HW will clear bit)
        while (_FLD2VAL(FLASHC_FLASH_CMD_INV, base->FLASH_CMD) != 0U)
        {
        }
    }
    return result;
}

/*******************************************************************************
* Function Name: Cy_Flash_EraseResume
****************************************************************************//**
*
* This function calls to resume a suspended erase operation. 
* Reports success or a reason for failure.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
*
* \param config configuration of this function.
* This parameter is defined by the \ref cy_stc_flash_eraseresume_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseResume(const cy_stc_flash_eraseresume_config_t *config)
{
    /* Checks if input pointers are not NULL */
    if (config == NULL)
    {
        return (cy_en_flashdrv_status_t)CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.EraseResume.arg0.opcode   = (uint32_t)CY_SROM_OP_FLASH_ERASE_RESUME;
    apiArgs.EraseResume.arg0.blocking = (uint32_t)config->intrMask;
    apiArgs.EraseResume.arg0.intrmask = (uint32_t)config->blocking;

    /* Call SROM API with blocking mode */
    un_srom_api_resps_t apiResp = {{ 0UL }};
    cy_en_srom_driver_status_t sromDrvStatus;
    sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
    if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
    {
        return CY_FLASH_DRV_IPC_BUSY;
    }
    else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
    {
        return CY_FLASH_DRV_SROM_API_TIMEOUT;
    }
    else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    else
    {
        /* Process response message from API */
        cy_en_flashdrv_status_t result;
        result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
        return result;
    }
}


/*******************************************************************************
* Function Name: Cy_Flash_BlankCheck
****************************************************************************//**
*
* This function performs blank check on the addressed work FLASH.
* Reports success or a reason for failure.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
*
* \param config configuration of this function.
* This parameter is defined by the \ref cy_stc_flash_blankcheck_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \param block specifies if the function to execute in blocking or non blocking mode.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_BlankCheck(const cy_stc_flash_blankcheck_config_t *config, cy_en_flash_driver_blocking_t block)
{
    /* Checks if input pointers are not NULL */
    if (config == NULL)
    {
        return (cy_en_flashdrv_status_t)CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

