zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
    FLASHC_Type *base;

    /* Resolve base from address to be checked */
    if (Cy_Flash_ResolveBase((uint32_t)config->addrToBeChecked, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    uint8_t *nonBlockContext = Cy_Flash_GetNonBlockContext(base);

    if (nonBlockContext == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    if(config->numOfWordsToBeChecked == 0UL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Checks if input address are valid */
    if ((Cy_Flash_WorkBoundsCheck(base, (uint32_t)config->addrToBeChecked) == CY_FLASH_OUT_OF_BOUNDS) ||
        (Cy_Flash_WorkBoundsCheck(base, (uint32_t)config->addrToBeChecked + config->numOfWordsToBeChecked*4UL - 1UL) == CY_FLASH_OUT_OF_BOUNDS))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.BlankCheck.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_BLANK_CHECK;
    apiArgs.BlankCheck.arg1.addrToBeChecked = (uint32_t)config->addrToBeChecked;
    apiArgs.BlankCheck.arg2.numOfWordsToBeChecked = (config->numOfWordsToBeChecked - 1UL);

    /* Tries to acquire the IPC structure and pass the arguments to SROM API */
    if(block == CY_FLASH_DRIVER_BLOCKING)
    {
        /* Call SROM API with blocking mode */
        un_srom_api_resps_t apiResp = {{ 0UL }};
        cy_en_srom_driver_status_t sromDrvStatus;
        sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
        if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
        {
            return CY_FLASH_DRV_IPC_BUSY;
        }
        else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
        {
            return CY_FLASH_DRV_SROM_API_TIMEOUT;
        }
        else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
        {
            return CY_FLASH_DRV_ERR_UNC;
        }
        else
        {
            /* Process response message from API */
            cy_en_flashdrv_status_t result;
            result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
            return result;
        }
    }
    else
    {
        *nonBlockContext = (uint8_t)FLASHC_FM_CTL_ECT_STATUS_BLANK_CHECK_WORK_Msk;
        /* Send message by IPC */
        cy_en_srom_driver_status_t status = Cy_Srom_CallApi_NonBlock(&apiArgs);
        if (status != CY_SROM_DR_SUCCEEDED)
        {
            /* The IPC structure is already locked by another process */
            return CY_FLASH_DRV_IPC_BUSY;
        }
        return CY_FLASH_DRV_SUCCESS;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC
****************************************************************************//**
*
* This function enables ECC injection and sets the address where a parity will be injected 
* and the parity value.
* Reports success or a reason for failure.
*
* \param region An indicator which region (Code/Work/Cache) ECC parity will be injected to.
* This parameter is defined by the cy_en_region_t
* in \ref group_flash_macros macro.
*
* \param address The address where ECC parity will be injected.
*
* \param parity The parity value which will be injected.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flashc_InjectECC(cy_en_region_t region, uint32_t address, uint8_t parity)
{
    FLASHC_Type *base;

    /* Resolve base from address */
    if (Cy_Flash_ResolveBase(address, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    switch(region)
    {
    case CY_FLASH_MAIN_REGION:
        if (Cy_Flash_MainBoundsCheck(base, address) == CY_FLASH_OUT_OF_BOUNDS)
        {
                return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
        }
        base->FLASH_CTL |= _VAL2FLD(FLASHC_FLASH_CTL_MAIN_ECC_INJ_EN, 1U);
        base->ECC_CTL = (_VAL2FLD(FLASHC_ECC_CTL_WORD_ADDR, (address >> CY_FLASH_CODE_ECC_INJECT_POS)) |
                         _VAL2FLD(FLASHC_ECC_CTL_PARITY, parity ));
        break;
    case CY_FLASH_WORK_REGION:
        if (Cy_Flash_WorkBoundsCheck(base, address) == CY_FLASH_OUT_OF_BOUNDS)
        {
            return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
        }
        base->FLASH_CTL |= _VAL2FLD(FLASHC_FLASH_CTL_WORK_ECC_INJ_EN, 1U);
        base->ECC_CTL = (_VAL2FLD(FLASHC_ECC_CTL_WORD_ADDR, (address >> CY_FLASH_WORK_ECC_INJECT_POS)) |
                         _VAL2FLD(FLASHC_ECC_CTL_PARITY, parity ));
        break;
    case CY_FLASH_CA_CM0P_REGION:
        if (Cy_Flash_MainBoundsCheck(base, address) == CY_FLASH_OUT_OF_BOUNDS)
        {
                return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
        }
        base->CM0_CA_CTL0 |= _VAL2FLD(FLASHC_CM0_CA_CTL0_RAM_ECC_INJ_EN, 1U);
        base->ECC_CTL = (_VAL2FLD(FLASHC_ECC_CTL_WORD_ADDR, (address >> CY_FLASH_CACHE_ECC_INJECT_POS)) |
                         _VAL2FLD(FLASHC_ECC_CTL_PARITY, parity ));
        break;
    default:
        // Default case. Nothing to do.
        break;
    }

    return CY_FLASH_DRV_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC_Disable
****************************************************************************//**
*
* This function disables ECC injection for the region specified.
*
* \note This function is applicable for CAT1C devices.
*
*******************************************************************************/
void Cy_Flashc_InjectECC_Disable_Base(FLASHC_Type *base, cy_en_region_t region)
{
    if (!Cy_Flash_IsValidBase(base))
    {
        return;
    }

    switch(region)
    {
    case CY_FLASH_MAIN_REGION:
        base->FLASH_CTL &= ~FLASHC_FLASH_CTL_MAIN_ECC_INJ_EN_Msk;
        break;
    case CY_FLASH_WORK_REGION:
        base->FLASH_CTL &= ~FLASHC_FLASH_CTL_WORK_ECC_INJ_EN_Msk;
        break;
    case CY_FLASH_CA_CM0P_REGION:
        base->CM0_CA_CTL0 &= ~FLASHC_CM0_CA_CTL0_RAM_ECC_INJ_EN_Msk;
        break;
    default:
        // Default case. Nothing to do.
        break;
    }
}

