zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_OperationStatus
****************************************************************************//**
*
* Checks the status of the Flash Operation, and returns it.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_OperationStatus_Base(FLASHC_Type *base)
{
    uint8_t *nonBlockContext = Cy_Flash_GetNonBlockContext(base);
    un_srom_api_resps_t resp = {{ 0UL }};
    if (nonBlockContext == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    if(0UL != (base->FM_CTL_ECT.STATUS & *nonBlockContext))
    {
        return CY_FLASH_DRV_OPERATION_STARTED;
    }
    else
    {
        *nonBlockContext = 0;
        cy_en_srom_api_status_t status = Cy_Srom_GetApiResponse(&resp);
        if(CY_SROM_STATUS_SUCCESS == status)
        {
            return Cy_Flash_ProcessOpcode(resp.resp[0]);
        }
        else if(CY_SROM_STATUS_INVALID == status)
        {
            /* Response not yet available or unknown format */
            return CY_FLASH_DRV_ERR_UNC;
        }
        else
        {
            /* SROM returned a specific error code (e.g. INVALID_FLASH_ADDR).
             * Process resp.resp[0] which contains the full error response. */
            return Cy_Flash_ProcessOpcode(resp.resp[0]);
        }

    }
}

/*******************************************************************************
* Function Name: Cy_Flash_StartWrite
****************************************************************************//**
*
* Starts programming the flash row with
* the input data. Returns immediately and reports a successful start
* or reason for failure. Reports a \ref CY_FLASH_DRV_IPC_BUSY error
* in the case when another process is writing to flash. User
* firmware should not enter the Hibernate or Deep-Sleep mode until
* flash Write is complete. The Flash operation is allowed in Sleep mode.
* During the flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, the low-voltage
* detect circuits should be configured to generate an interrupt instead of a reset.
* Otherwise, portions of flash may undergo unexpected changes.
* \note Before reading data from previously programmed/erased flash rows, the
* user must clear the flash cache with the Cy_SysLib_ClearFlashCacheAndBuffer()
* function.
*
* \param rowAddr Address of the flash row number.
* The Read-while-Write violation occurs when the flash read operation is
* initiated in the same flash sector where the flash write operation is
* performing. Refer to the device datasheet for the details.
* Address must match row start address.
*
* \param data The pointer to the data to be written to flash. The size
* of the data array must be equal to the flash row size. The flash row size for
* the selected device is defined by the \ref CY_FLASH_SIZEOF_ROW macro. Refer to
* the device datasheet for the details.
*
* \return Returns the status of the Flash operation,
* see \ref cy_en_flashdrv_status_t.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_StartWrite(uint32_t rowAddr, const uint32_t* data)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    FLASHC_Type *base;

    /* Resolve base from row address */
    if (Cy_Flash_ResolveBase(rowAddr, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    uint8_t *nonBlockContext = Cy_Flash_GetNonBlockContext(base);
    uint32_t prog_length = (uint32_t)ADDRESS_LENGTH_32_BIT;
    uint32_t data_length = (uint32_t)DATA_LENGTH_32_BIT;
    if ((nonBlockContext == NULL) || (data == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    else
    {
        
        cy_stc_flash_programrow_config_t flash_programrow_config =
        {
            .destAddr  =   (const uint32_t *)rowAddr,
            .dataAddr  =   (const uint32_t *)data,
            .blocking  =   CY_FLASH_PROGRAMROW_NON_BLOCKING,
            .skipBC    =   CY_FLASH_PROGRAMROW_SKIP_BLANK_CHECK,
            .dataSize  =   CY_FLASH_PROGRAMROW_DATA_SIZE_32BIT,
            .dataLoc   =   CY_FLASH_PROGRAMROW_DATA_LOCATION_SRAM,
            .intrMask  =   CY_FLASH_PROGRAMROW_SET_INTR_MASK,
        };
        /* Checks whether the input parameters are valid */
        if(Cy_Flash_WorkBoundsCheck(base, rowAddr) == CY_FLASH_IN_BOUNDS)
        {
            flash_programrow_config.dataSize = CY_FLASH_PROGRAMROW_DATA_SIZE_32BIT;
        }
        else if(Cy_Flash_MainBoundsCheck(base, rowAddr) == CY_FLASH_IN_BOUNDS)
        {
            prog_length = ADDRESS_LENGTH_256_BIT;
            data_length = DATA_LENGTH_256_BIT;
            flash_programrow_config.dataSize = CY_FLASH_PROGRAMROW_DATA_SIZE_256BIT;
        }
        else
        {
            /* non-empty terminating "else" statement */
        }

        for(uint32_t i_addr = rowAddr;  i_addr < rowAddr + CY_FLASH_SIZEOF_ROW; i_addr+=prog_length)
        {
            flash_programrow_config.destAddr = (const uint32_t *)i_addr;
            flash_programrow_config.dataAddr = (const uint32_t *)(data);
            *nonBlockContext = (uint8_t)(FLASHC_FM_CTL_ECT_STATUS_PGM_WORK_Msk | FLASHC_FM_CTL_ECT_STATUS_PGM_CODE_Msk);
            result = Cy_Flash_Program(&flash_programrow_config,CY_FLASH_DRIVER_NON_BLOCKING);
            if(result == CY_FLASH_DRV_OPERATION_STARTED)
            {
                while((Cy_Flash_IsOperationComplete_Base(base) != CY_FLASH_DRV_SUCCESS))
                {
                }
                data+=data_length;
            }
            else
            {
                return result;
            }
        }
    }
    return CY_FLASH_DRV_OPERATION_STARTED;
}

/*******************************************************************************
* Function Name: Cy_Flash_StartEraseSector
****************************************************************************//**
*
* Starts erasing a sector of flash. Returns immediately
* and reports a successful start or reason for failure.
* Reports a CY_FLASH_DRV_IPC_BUSY error in the case when IPC structure is locked
* by another process. User firmware should not enter the Hibernate or Deep Sleep mode until
* flash Erase is complete. The Flash operation is allowed in Sleep mode.
* During the flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, the low-voltage
* detect circuits should be configured to generate an interrupt instead of a reset.
* Otherwise, portions of flash may undergo unexpected changes.
* Before reading data from previously programmed/erased flash rows, the
* user must clear the flash cache with the Cy_SysLib_ClearFlashCacheAndBuffer()
* function.
*
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_StartEraseSector(uint32_t sectorAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    FLASHC_Type *base;

