zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
    /* Resolve base from sector address */
    if (Cy_Flash_ResolveBase(sectorAddr, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks whether the input parameters are valid */
    if(Cy_Flash_BoundsCheck(base, (uint32_t)(sectorAddr)) == CY_FLASH_OUT_OF_BOUNDS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    cy_stc_flash_erasesector_config_t flash_erasesector_config =
    {
        .sectorAddr  =  (const uint32_t *)sectorAddr,
        .blocking    =  CY_FLASH_ERASESECTOR_BLOCKING,
        .intrMask    =  CY_FLASH_ERASESECTOR_NOT_SET_INTR_MASK,
    };
    result = Cy_Flash_EraseSector_Ext(base, &flash_erasesector_config, CY_FLASH_DRIVER_BLOCKING);

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_CalculateHash
****************************************************************************//**
*
* Returns a hash value of the specified region of flash.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_CalculateHash(const uint32_t* data, uint32_t numberOfBytes, uint32_t* hashPtr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;

    /* Checks whether the input parameters are valid */
    if ((data == NULL) || (numberOfBytes == 0UL) || (hashPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    cy_stc_flash_computehash_config_t flash_computehash_config =
    {
        .startAddr =  (const uint32_t *)data,
        .numOfByte =  numberOfBytes,
        .type      =  CY_FLASH_COMPUTEHASH_BASIC,
    };
    result = Cy_Flash_CalculateHash_Ext(&flash_computehash_config, hashPtr);

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_RowChecksum
****************************************************************************//**
*
* Returns a checksum value of the specified flash row.
*
* \note Now Cy_Flash_RowChecksum() requires the row <b>address</b> (rowAddr)
*       as a parameter. In previous versions of the driver, this function used
*       the row <b>number</b> (rowNum) for this parameter.
*
* \param rowAddr The address of the flash row.
*
* \param checksumPtr The pointer to the address where checksum is to be stored
*
* \return Returns the status of the Flash operation.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_RowChecksum(uint32_t rowAddr, uint32_t* checksumPtr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    uint8_t rowID = 0;
    cy_en_flash_checksum_bank_t bank = CY_FLASH_CHECKSUM_BANK0;
    cy_en_flash_checksum_region_t region = CY_FLASH_CHECKSUM_MAIN;
    FLASHC_Type *base;

    /* Resolve base from row address */
    if (Cy_Flash_ResolveBase(rowAddr, &base) != CY_FLASH_DRV_SUCCESS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks whether the input parameters are valid */
    if ((Cy_Flash_BoundsCheck(base, rowAddr)== CY_FLASH_OUT_OF_BOUNDS) || (checksumPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    if (CY_FLASH_DRV_SUCCESS == Cy_Flash_GetRowDetails(base, rowAddr,&rowID, &bank, &region))
    {
        cy_stc_flash_checksum_config_t flash_computechecksum_config =
        {
            .rowId      =  rowID,
            .bank       =  bank,
            .whole      =  CY_FLASH_CHECKSUM_PAGE,
            .region     = region,
        };
        result = Cy_Flash_Checksum(&flash_computechecksum_config, checksumPtr);
    }

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_GetRowDetails
****************************************************************************//**
*
* Returns flash region ID, Bank and row number of the Flash address.
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_GetRowDetails(FLASHC_Type *base, uint32_t rowAddr, uint8_t *rowID, cy_en_flash_checksum_bank_t *bank, cy_en_flash_checksum_region_t *region)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    if (Cy_Flash_BoundsCheck(base, rowAddr) == CY_FLASH_OUT_OF_BOUNDS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

#if defined(FLASHC1)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address comparison.');
    bool isFlashc1 = (base == (FLASHC_Type *)FLASHC1);
#endif

    cy_en_bankmode_t bankmode = Cy_Flashc_GetMainBankMode_Base(base);
    if(bankmode == CY_FLASH_SINGLE_BANK_MODE)
    {
        if ((rowAddr >= CY_WFLASH_LG_SBM_TOP) && (rowAddr < CY_WFLASH_SM_SBM_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_WORK;
            result = CY_FLASH_DRV_SUCCESS;
        }
        else if ((rowAddr >= CY_FLASH_LG_SBM_TOP) && (rowAddr < CY_FLASH_SM_SBM_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_FLASH_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_MAIN;
            result = CY_FLASH_DRV_SUCCESS;
        }
#if defined(FLASHC1)
        else if (isFlashc1)
        {
            if ((rowAddr >= CY_WFLASH1_LG_SBM_TOP) && (rowAddr < CY_WFLASH1_SM_SBM_END))
            {
                *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                         ((rowAddr - CY_WFLASH1_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
                *bank = CY_FLASH_CHECKSUM_BANK0;
                *region = CY_FLASH_CHECKSUM_WORK;
                result = CY_FLASH_DRV_SUCCESS;
            }
            else if ((rowAddr >= CY_FLASH1_LG_SBM_TOP) && (rowAddr < CY_FLASH1_SM_SBM_END))
            {
                *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                         ((rowAddr - CY_FLASH1_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
                *bank = CY_FLASH_CHECKSUM_BANK0;
                *region = CY_FLASH_CHECKSUM_MAIN;
                result = CY_FLASH_DRV_SUCCESS;
            }
            else
            {
                /* rowAddr out of bounds. */
            }
        }
#endif /* defined(FLASHC1) */
        else
        {
            /* rowAddr out of bounds. */
        }
    }
    else
    {
        if ((rowAddr >= CY_WFLASH_LG_DBM0_TOP) && (rowAddr < CY_WFLASH_SM_DBM0_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_DBM0_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_WORK;
            result = CY_FLASH_DRV_SUCCESS;
        }
        else if ((rowAddr >= CY_WFLASH_LG_DBM1_TOP) && (rowAddr < CY_WFLASH_SM_DBM1_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_DBM1_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK1;
            *region = CY_FLASH_CHECKSUM_WORK;
            result = CY_FLASH_DRV_SUCCESS;
        }
        else if ((rowAddr >= CY_FLASH_LG_DBM0_TOP) && (rowAddr < CY_FLASH_SM_DBM0_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_FLASH_LG_DBM0_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_MAIN;
            result = CY_FLASH_DRV_SUCCESS;
        }
        else if ((rowAddr >= CY_FLASH_LG_DBM1_TOP) && (rowAddr < CY_FLASH_SM_DBM1_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_FLASH_LG_DBM1_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK1;
            *region = CY_FLASH_CHECKSUM_MAIN;
            result = CY_FLASH_DRV_SUCCESS;
        }
#if defined(FLASHC1)
        else if (isFlashc1)
        {
            if ((rowAddr >= CY_WFLASH1_LG_DBM0_TOP) && (rowAddr < CY_WFLASH1_SM_DBM0_END))
            {
                *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                         ((rowAddr - CY_WFLASH1_LG_DBM0_TOP) / CY_FLASH_SIZEOF_ROW));
                *bank = CY_FLASH_CHECKSUM_BANK0;
                *region = CY_FLASH_CHECKSUM_WORK;
                result = CY_FLASH_DRV_SUCCESS;
            }
            else if ((rowAddr >= CY_WFLASH1_LG_DBM1_TOP) && (rowAddr < CY_WFLASH1_SM_DBM1_END))
            {
                *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                         ((rowAddr - CY_WFLASH1_LG_DBM1_TOP) / CY_FLASH_SIZEOF_ROW));
                *bank = CY_FLASH_CHECKSUM_BANK1;
                *region = CY_FLASH_CHECKSUM_WORK;
                result = CY_FLASH_DRV_SUCCESS;
            }
            else if ((rowAddr >= CY_FLASH1_LG_DBM0_TOP) && (rowAddr < CY_FLASH1_SM_DBM0_END))
            {
                *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                         ((rowAddr - CY_FLASH1_LG_DBM0_TOP) / CY_FLASH_SIZEOF_ROW));
                *bank = CY_FLASH_CHECKSUM_BANK0;
                *region = CY_FLASH_CHECKSUM_MAIN;
                result = CY_FLASH_DRV_SUCCESS;
            }
            else if ((rowAddr >= CY_FLASH1_LG_DBM1_TOP) && (rowAddr < CY_FLASH1_SM_DBM1_END))
            {
                *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                         ((rowAddr - CY_FLASH1_LG_DBM1_TOP) / CY_FLASH_SIZEOF_ROW));
                *bank = CY_FLASH_CHECKSUM_BANK1;
                *region = CY_FLASH_CHECKSUM_MAIN;
                result = CY_FLASH_DRV_SUCCESS;
            }
            else
            {
                /* rowAddr out of bounds. */
            }
        }
#endif /* defined(FLASHC1) */
        else
        {
            /* rowAddr out of bounds. */
        }
    }

    return (result);
}

