zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_Init
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be called from each core.
*
* This function is called in the SystemInit() function, for proper flash write
* and erase operations. If the default startup file is not used, or the function
* SystemInit() is not called in your project, ensure to perform the following steps
* before any flash or EmEEPROM write/erase operations:
*
*******************************************************************************/
void Cy_Flash_Init(void)
{
    /* In Blocking mode the calling function get's the response and sends it to the user.
     * In Non blocking mode user will call operation status and gets the response in return.
     * There is no need for the driver to handle error in the interrupt handler.
     * Error needs to be passed to the user.
     */
    Cy_Srom_SetResponseHandler(NULL);

    g_ds_cbHandler.callback = Cy_Flash_DSCallbackFunc;
    g_ds_cbHandler.type = CY_SYSPM_DEEPSLEEP;
    g_ds_cbHandler.skipMode = 0;
    g_ds_cbHandler.callbackParams = &g_ds_params;
    g_ds_cbHandler.prevItm = NULL;
    g_ds_cbHandler.nextItm = NULL;
    g_ds_cbHandler.order = 0;

    (void)Cy_SysPm_RegisterCallback(&g_ds_cbHandler);
}

/*******************************************************************************
* Function Name: Cy_Flash_IsOperationComplete
****************************************************************************//**
*
* Reports a successful operation result, reason of failure or busy status
* ( CY_FLASH_DRV_OPCODE_BUSY ).
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_IsOperationComplete_Base(FLASHC_Type *base)
{
    return (Cy_Flash_OperationStatus_Base(base));
}


/*******************************************************************************
* Function Name: Cy_Flashc_MainWriteEnable
****************************************************************************//**
*
* Enable writing main flash
*
*******************************************************************************/
void Cy_Flashc_MainWriteEnable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FM_CTL_ECT.MAIN_FLASH_SAFETY |= FLASHC_FM_CTL_ECT_MAIN_FLASH_SAFETY_MAINFLASHWRITEENABLE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_MainWriteDisable
****************************************************************************//**
*
* Disable writing main flash
*
*******************************************************************************/
void Cy_Flashc_MainWriteDisable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FM_CTL_ECT.MAIN_FLASH_SAFETY &= (uint32_t) ~FLASHC_FM_CTL_ECT_MAIN_FLASH_SAFETY_MAINFLASHWRITEENABLE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_WorkWriteEnable
****************************************************************************//**
*
* Enable writing work flash
*
*******************************************************************************/
void Cy_Flashc_WorkWriteEnable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FM_CTL_ECT.WORK_FLASH_SAFETY |= FLASHC_FM_CTL_ECT_WORK_FLASH_SAFETY_WORKFLASHWRITEENABLE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_WorkWriteDisable
****************************************************************************//**
*
* Disable writing work flash
*
*******************************************************************************/
void Cy_Flashc_WorkWriteDisable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FM_CTL_ECT.WORK_FLASH_SAFETY &= (uint32_t) ~FLASHC_FM_CTL_ECT_WORK_FLASH_SAFETY_WORKFLASHWRITEENABLE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_WorkECCEnable
****************************************************************************//**
*
* Enables ECC for work flash
*
*******************************************************************************/
void Cy_Flashc_WorkECCEnable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FLASH_CTL |= FLASHC_FLASH_CTL_WORK_ECC_EN_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_WorkECCDisable
****************************************************************************//**
*
* Disables ECC for work flash
*
*******************************************************************************/
void Cy_Flashc_WorkECCDisable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FLASH_CTL &= (uint32_t) ~FLASHC_FLASH_CTL_WORK_ECC_EN_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_MainECCEnable
****************************************************************************//**
*
* Enables ECC for main flash
*
*******************************************************************************/
void Cy_Flashc_MainECCEnable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FLASH_CTL |= FLASHC_FLASH_CTL_MAIN_ECC_EN_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_MainECCDisable
****************************************************************************//**
*
* Disables ECC for main flash
*
*******************************************************************************/
void Cy_Flashc_MainECCDisable_Base(FLASHC_Type *base)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FLASH_CTL &= (uint32_t) ~FLASHC_FLASH_CTL_MAIN_ECC_EN_Msk;
    }
}

