zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flashc_SetWorkBankMode
****************************************************************************//**
*
* Sets bank mode for work flash
*
* \param base Pointer to the selected FLASH controller instance.
*
* \param mode bank mode to be set
*
*******************************************************************************/
void Cy_Flashc_SetWorkBankMode_Base(FLASHC_Type *base, cy_en_bankmode_t mode)
{
    if (!Cy_Flash_IsValidBase(base))
    {
        return;
    }

    if(CY_FLASH_DUAL_BANK_MODE == mode)
    {
        base->FLASH_CTL |= FLASHC_FLASH_CTL_WORK_BANK_MODE_Msk;
    }
    else
    {
        base->FLASH_CTL &= (uint32_t) ~FLASHC_FLASH_CTL_WORK_BANK_MODE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_GetWorkBankMode
****************************************************************************//**
*
* Gets current bank mode for work flash
*
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetWorkBankMode_Base(FLASHC_Type *base)
{
    if (!Cy_Flash_IsValidBase(base))
     {
          return CY_FLASH_SINGLE_BANK_MODE;
     }

    uint32_t bank_mode = _FLD2VAL(FLASHC_FLASH_CTL_WORK_BANK_MODE, base->FLASH_CTL);
   if(bank_mode == 0UL)
    {
        return CY_FLASH_SINGLE_BANK_MODE;
    }
    else
    {
        return CY_FLASH_DUAL_BANK_MODE;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_SetMainBankMode
****************************************************************************//**
*
*  Sets bank mode for main flash
*
*  \param base Pointer to the selected FLASH controller instance.
*
*  \param mode bank mode to be set
*
*******************************************************************************/
void Cy_Flashc_SetMainBankMode_Base(FLASHC_Type *base, cy_en_bankmode_t mode)
{
   if (!Cy_Flash_IsValidBase(base))
    {
        return;
    }

   if(CY_FLASH_DUAL_BANK_MODE == mode)
    {
        base->FLASH_CTL |= FLASHC_FLASH_CTL_MAIN_BANK_MODE_Msk;
    }
    else
    {
        base->FLASH_CTL &= (uint32_t) ~FLASHC_FLASH_CTL_MAIN_BANK_MODE_Msk;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_GetMainBankMode
****************************************************************************//**
*
*  Gets current bank mode for main flash
*
*******************************************************************************/
cy_en_bankmode_t Cy_Flashc_GetMainBankMode_Base(FLASHC_Type *base)
{
    if (!Cy_Flash_IsValidBase(base))
    {
        return CY_FLASH_SINGLE_BANK_MODE;
    }

    uint32_t bank_mode = _FLD2VAL(FLASHC_FLASH_CTL_MAIN_BANK_MODE, base->FLASH_CTL);
    if(bank_mode == 0UL)
    {
        return CY_FLASH_SINGLE_BANK_MODE;
    }
    else
    {
        return CY_FLASH_DUAL_BANK_MODE;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_SetMain_Flash_Mapping
****************************************************************************//**
*
* \brief Sets mapping for main flash region. Applicable only in Dual Bank mode of Main flash region
*
* \param mapping mapping to be set
*
* \return none
*******************************************************************************/
void Cy_Flashc_SetMain_Flash_Mapping_Base(FLASHC_Type *base, cy_en_maptype_t  mapping)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FLASH_CTL &= ~FLASHC_FLASH_CTL_MAIN_MAP_Msk;
        base->FLASH_CTL |= _VAL2FLD(FLASHC_FLASH_CTL_MAIN_MAP, mapping);
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_SetWork_Flash_Mapping
****************************************************************************//**
*
* \brief Sets mapping for work flash region. Applicable only in Dual Bank mode of Work flash region
*
* \param mapping mapping to be set
*
* \return none
*******************************************************************************/
void Cy_Flashc_SetWork_Flash_Mapping_Base(FLASHC_Type *base, cy_en_maptype_t mapping)
{
    if (Cy_Flash_IsValidBase(base))
    {
        base->FLASH_CTL &= ~FLASHC_FLASH_CTL_WORK_MAP_Msk;
        base->FLASH_CTL |= _VAL2FLD(FLASHC_FLASH_CTL_WORK_MAP, mapping);
    }
}


/*******************************************************************************
* Function Name: Cy_Flash_DSCallbackFunc
****************************************************************************//**
*
* \brief Deep sleep Callback function
*
* \param callbackParams syspm callback params
*
* \param mode syspm callback mode
*
* \return none
*******************************************************************************/
static cy_en_syspm_status_t Cy_Flash_DSCallbackFunc(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    CY_UNUSED_PARAMETER(callbackParams);

    switch(mode)
    {
        case CY_SYSPM_CHECK_READY:
        {
            retVal = CY_SYSPM_SUCCESS;
        }
        break;
        case CY_SYSPM_CHECK_FAIL:
        {
            retVal = CY_SYSPM_SUCCESS;
        }
        break;
        case CY_SYSPM_BEFORE_TRANSITION:
        {
            Cy_Flashc_WorkWriteDisable_Base((FLASHC_Type *)FLASHC);
            Cy_Flashc_MainWriteDisable_Base((FLASHC_Type *)FLASHC);
#if defined(FLASHC1)
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address.');
            Cy_Flashc_WorkWriteDisable_Base((FLASHC_Type *)FLASHC1);
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address.');
            Cy_Flashc_MainWriteDisable_Base((FLASHC_Type *)FLASHC1);
#endif
            retVal = CY_SYSPM_SUCCESS;
        }
        break;
        case CY_SYSPM_AFTER_TRANSITION:
        {
            Cy_Flashc_WorkWriteEnable_Base((FLASHC_Type *)FLASHC);
            Cy_Flashc_MainWriteEnable_Base((FLASHC_Type *)FLASHC);
#if defined(FLASHC1)
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address.');
            Cy_Flashc_WorkWriteEnable_Base((FLASHC_Type *)FLASHC1);
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3','Intentional pointer type conversion from FLASHC1_Type to FLASHC_Type for base address.');
            Cy_Flashc_MainWriteEnable_Base((FLASHC_Type *)FLASHC1);
#endif
            retVal = CY_SYSPM_SUCCESS;
        }
        break;
        default:
            /* default case */
            break;
    }

    return retVal;
}


#endif // defined(CY_IP_MXFLASHC_VERSION_ECT)

/* [] END OF FILE */
